Repository: Centaur/lua-nginx-module
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This directive is designed to execute short, fast running code blocks as the Nginx event loop is blocked during code execution.
zh_cn: 这条命令是被设计用来执行短的，能很快结束的代码块，在它执行时Nginx事件循环是被阻塞的。

source: This directive is turned <code>on</code> by default.
zh_cn: 本命令默认值为 <code>on</code> .

source: This directive requires the [https://github.com/simpl/ngx_devel_kit ngx_devel_kit] module.
zh_cn: 这条命令需要 [https://github.com/simpl/ngx_devel_kit ngx_devel_kit] 模块.

source: This directive was first introduced in the <code>v0.2.1rc20</code> release.
zh_cn: 本命令在 <code>v0.2.1rc20</code> 版本中引入.

source: This directive was first introduced in the <code>v0.3.1rc22</code> release.
zh_cn: 本命令在 <code>v0.3.1rc22</code> 版本中引入.

source: This directive was first introduced in the <code>v0.5.0rc19</code> release.
zh_cn: 本命令在 <code>v0.5.0rc19</code> 版本中引入.

source: This directive was first introduced in the <code>v0.5.0rc1</code> release.
zh_cn: 本命令在 <code>v0.5.0rc1</code> 版本中引入.

source: This directive was first introduced in the <code>v0.5.0rc29</code> release.
zh_cn: 本命令在 <code>v0.5.0rc29</code> 版本中引入.

source: This directive was first introduced in the <code>v0.5.0rc31</code> release.
zh_cn: 本命令在 <code>v0.5.0rc31</code> 版本中引入.

source: This directive was first introduced in the <code>v0.5.0rc32</code> release.
zh_cn: 本命令在 <code>v0.5.0rc32</code> 版本中引入.

source: This directive was first introduced in the <code>v0.5.13</code> release.
zh_cn: 本命令在 <code>v0.5.13</code> 版本中引入.

source: This directive was first introduced in the <code>v0.5.5</code> release.
zh_cn: 本命令在 <code>v0.5.5</code> 版本中引入。

source: This directive was first introduced in the <code>v0.7.4</code> release.
zh_cn: 本命令在 <code>v0.7.4</code> 版本中引入.

source: This directive was first introduced in the <code>v0.8.0</code> release.
zh_cn: 本命令在 <code>v0.8.0</code> 版本中引入.

source: This directive was first introduced in the <code>v0.8.5</code> release.
zh_cn: 本命令在 <code>v0.8.5</code> 版本中引入.

source: This document describes ngx_lua [https://github.com/chaoslawful/lua-nginx-module/tags v0.8.5] released on 18 July 2013.
zh_cn: 本文对应的是 ngx_lua [https://github.com/chaoslawful/lua-nginx-module/tags v0.8.5]版本，发布于2013年7月8日.

source: This document describes ngx_lua [https://github.com/chaoslawful/lua-nginx-module/tags v0.8.6] released on 6 August 2013.
zh_cn: 本文对应的是 ngx_lua [https://github.com/chaoslawful/lua-nginx-module/tags v0.8.6]版本，发布于2013年8月6日.

source: This does not replace the current access logs, but runs after.
zh_cn: 它不会覆盖当前的访问日志，而是在记录访问日志之后运行.

source: This feature requires the [https://github.com/simpl/ngx_devel_kit ngx_devel_kit] module.
zh_cn: 这条功能需要 [https://github.com/simpl/ngx_devel_kit ngx_devel_kit] 模块.

source: This feature was first introduced in the <code>v0.2.1rc12</code> release.
zh_cn: 本功能在 <code>v0.2.1rc12</code> 版本中引入.

source: This feature was first introduced in the <code>v0.2.1rc13</code> release.
zh_cn: 本功能在 <code>v0.2.1rc13</code> 版本中引入.

source: This feature was first introduced in the <code>v0.2.1rc15</code> release.
zh_cn: 本功能在 <code>v0.2.1rc15</code> 版本中引入.

source: This feature was first introduced in the <code>v0.3.1rc22</code> release.
zh_cn: 本功能在 <code>v0.3.1rc22</code> 版本中引入.

source: This feature was first introduced in the <code>v0.5.0rc17</code> release.
zh_cn: 本功能在 <code>v0.5.0rc17</code> 版本中引入.

source: This feature was first introduced in the <code>v0.5.0rc1</code> release.
zh_cn: 本功能在 <code>v0.5.1rc1</code> 版本中引入.

source: This feature was first introduced in the <code>v0.5.7</code> release.
zh_cn: 本功能在 <code>v0.5.7</code> 版本中引入.

source: This feature was first introduced in the <code>v0.6.3</code> release.
zh_cn: 本功能在 <code>v0.6.3</code> 版本中引入.

source: This feature was first introduced in the <code>v0.7.18</code> release.
zh_cn: 本功能在 <code>v0.7.18</code> 版本中引入.

source: This feature was first introduced in the <code>v0.7.3</code> release.
zh_cn: 本功能在 <code>v0.7.3</code> 版本中引入.

source: This feature was introduced in the <code>v0.2.1rc11</code> release.
zh_cn: 此功能在 <code>v0.2.1rc11</code> 版本中引入.

source: This function can be used with [[#ngx.req.append_body|ngx.req.append_body]], [[#ngx.req.finish_body|ngx.req.finish_body]], and [[#ngx.req.socket|ngx.req.socket]] to implement efficient input filters in pure Lua (in the context of [[#rewrite_by_lua|rewrite_by_lua]]* or [[#access_by_lua|access_by_lua]]*), which can be used with other Nginx content handler or upstream modules like [[HttpProxyModule]] and [[HttpFastcgiModule]].
zh_cn: 此函数与 [[#ngx.req.append_body|ngx.req.append_body]], [[#ngx.req.finish_body|ngx.req.finish_body]], 和 [[#ngx.req.socket|ngx.req.socket]]一起使用，可以实现高效的纯Lua输入过滤器 (在[[#rewrite_by_lua|rewrite_by_lua]]* 或 [[#access_by_lua|access_by_lua]]* 中), 过滤器可与其它 Nginx 内容处理器或上游模块 [[HttpProxyModule]] 和 [[HttpFastcgiModule]]一起使用.

source: This function can be used with [[#ngx.req.init_body|ngx.req.init_body]], [[#ngx.req.append_body|ngx.req.append_body]], and [[#ngx.req.socket|ngx.req.socket]] to implement efficient input filters in pure Lua (in the context of [[#rewrite_by_lua|rewrite_by_lua]]* or [[#access_by_lua|access_by_lua]]*), which can be used with other Nginx content handler or upstream modules like [[HttpProxyModule]] and [[HttpFastcgiModule]].
zh_cn: 此函数与 [[#ngx.req.init_body|ngx.req.iit_body]], [[#ngx.req.append_body|ngx.req.append_body]], 和 [[#ngx.req.socket|ngx.req.socket]]一起使用，可以实现高效的纯Lua输入过滤器 (在[[#rewrite_by_lua|rewrite_by_lua]]* 或 [[#access_by_lua|access_by_lua]]* 中), 过滤器可与其它 Nginx 内容处理器或上游模块 [[HttpProxyModule]] 和 [[HttpFastcgiModule]]一起使用.

source: This function can be used with [[#ngx.req.init_body|ngx.req.init_body]], [[#ngx.req.finish_body|ngx.req.finish_body]], and [[#ngx.req.socket|ngx.req.socket]] to implement efficient input filters in pure Lua (in the context of [[#rewrite_by_lua|rewrite_by_lua]]* or [[#access_by_lua|access_by_lua]]*), which can be used with other Nginx content handler or upstream modules like [[HttpProxyModule]] and [[HttpFastcgiModule]].
zh_cn: 此函数与 [[#ngx.req.init_body|ngx.req.iit_body]], [[#ngx.req.finish_body|ngx.req.finish_body]], 和 [[#ngx.req.socket|ngx.req.socket]]一起使用，可以实现高效的纯Lua输入过滤器 (在[[#rewrite_by_lua|rewrite_by_lua]]* 或 [[#access_by_lua|access_by_lua]]* 中), 过滤器可与其它 Nginx 内容处理器或上游模块 [[HttpProxyModule]] 和 [[HttpFastcgiModule]]一起使用.

source: This function is a shortcut for combining [[#ngx.socket.tcp|ngx.socket.tcp()]] and the [[#tcpsock:connect|connect()]] method call in a single operation.
zh_cn: 此函数是将 [[#ngx.socket.tcp|ngx.socket.tcp()]] 和 [[#tcpsock:connect|connect()]] 组合到一个操作中的简写.

source: This function is added for [http://w3.impa.br/~diego/software/luasocket/tcp.html LuaSocket] API compatibility and does nothing for now.
zh_cn: 加入此函数是为了兼容[http://w3.impa.br/~diego/software/luasocket/tcp.html LuaSocket] API，它什么也不做.

source: This function is an asynchronous call and returns immediately.
zh_cn: 本函数是异步调用，会立即返回.

source: This function issues several parallel subrequests specified by the input table and returns their results in the same order.
zh_cn: 这个函数发起在输入table中指定的若干并行子请求，并以指定的顺序返回其结果。

source: This function requires SHA-1 support in the Nginx build.
zh_cn: 此函数需要编译Nginx时添加 SHA-1 支持.

source: This function returns <code>nil</code> if # the request body has not been read, # the request body has been read into disk temporary files, # or the request body has zero size.
zh_cn: 在以下情况下此函数返回 <code>nil</code> # 请求体尚未被读取, # 请求体已经被读进磁盘临时文件, # 请求体长度为0.

source: This function was first introduced in the <code>v0.3.1rc17</code> release.
zh_cn: 本命令在 <code>v0.3.1rc17</code> 版本中引入.

source: This function was first introduced in the <code>v0.3.1rc18</code> release.
zh_cn: 本命令在 <code>v0.3.1rc18</code> 版本中引入.

source: This function was first introduced in the <code>v0.3.1rc29</code> release.
zh_cn: 本命令在 <code>v0.3.1rc29</code> 版本中引入.

source: This function was first introduced in the <code>v0.5.0rc1</code> release.
zh_cn: 本命令在 <code>v0.5.0rc1</code> 版本中引入.

source: This function was first introduced in the <code>v0.5.0rc6</code>.
zh_cn: 本命令在 <code>v0.5.0rc6</code> 版本中引入.

source: This function was first introduced in the <code>v0.5.11</code> release.
zh_cn: 本命令在 <code>v0.5.11</code> 版本中引入.

source: This function was first introduced in the <code>v0.7.7</code> release.
zh_cn: 本命令在 <code>v0.7.7</code> 版本中引入.

source: This function will not return until all the subrequests terminate.
zh_cn: 这个函数只有在所有子请求都结束后才会返回。

source: This function will return but with no returned values when the <code>jump</code> argument is <code>false</code> or absent altogether.
zh_cn: <code>jump</code>参数为<code>false</code>或不提供时，这个函数会返回，但没有返回值。

source: This however carries some risks and is not ordinarily recommended.
zh_cn: 但这种做法会带来风险，通常并不推荐。

source: This however is not normally allowed within ngx_lua and will usually result in error messages like <code>lua handler aborted: runtime error: attempt to yield across C-call boundary</code>.
zh_cn: 这在 ngx_lua 中是不允许的，将会导致错误信息如 <code>lua handler aborted: runtime error: attempt to yield across C-call boundary</code>.

source: This interface was first introduced in the <code>v0.3.1rc13</code> release.
zh_cn: 本命令在 <code>v0.3.1rc13</code> 版本中引入.

source: This interface was first introduced in the <code>v0.3.1rc14</code> release.
zh_cn: 本命令在 <code>v0.3.1rc14</code> 版本中引入.

source: This is an asynchronous call and will return immediately without waiting for all the data to be written into the system send buffer.
zh_cn: 这是一个异常调用，立即返回 ，不需要等待所有数据被写进系统发送缓冲区.

source: This is because they have two separate versions of <code>ngx.ctx.blah</code>.
zh_cn: 这是因为它们是两个不同的版本.

source: This is functionally identical to the previous examples.
zh_cn: 这段代码与前面的代码在功能上完全一致。

source: This is not recommended however).
zh_cn: 虽然我们并不推荐这样做).

source: This is particularly the case when LuaJIT 2.0 is enabled.
zh_cn: 在使用LuaJit 2.0时尤其如此.

source: This is particularly useful in the context of [[#header_filter_by_lua|header_filter_by_lua]] and [[#header_filter_by_lua_file|header_filter_by_lua_file]], for example,
zh_cn: 这在 [[#header_filter_by_lua|header_filter_by_lua]] 和 [[#header_filter_by_lua_file|header_filter_by_lua_file]]的上下文中特别有用, 例如,

source: This is the UTC time.
zh_cn: 这是UTC时间.

source: This is the inverse function of [[#ngx.encode_args|ngx.encode_args]].
zh_cn: 此函数是 [[#ngx.encode_args|ngx.encode_args]] 的反函数.

source: This is the local time.
zh_cn: 这是本地时间.

source: This issue is due to limitations in the Nginx event model and only appears to affect Mac OS X.
zh_cn: 此问题源于Nginx事件模型的限制，似乎仅在Mac OS X上发生.

source: This limit can be manually modified by editing the <code>NGX_MAX_ERROR_STR</code> macro definition in the <code>src/core/ngx_log.h</code> file in the Nginx source tree.
zh_cn: 可以手工修改Nginx代码树中的<code>src/core/ngx_log.h</code>文件中的 <code>NGX_MAX_ERROR_STR</code> 宏定义来修改这个上限。

source: This limit includes trailing newlines and leading time stamps.
zh_cn: 这个限制包括了最后的换行和头部的时间戳。

source: This mechanism allows calling other nginx C modules' directives that are implemented by [https://github.com/simpl/ngx_devel_kit Nginx Devel Kit] (NDK)'s set_var submodule's <code>ndk_set_var_value</code>.
zh_cn: 此机制允许调用由[https://github.com/simpl/ngx_devel_kit Nginx Devel Kit] (NDK) set_var 子模块的 <code>ndk_set_var_value</code>实现的其它nginx C模块命令。.

source: This method ''must'' be called before [[#ngx.send_headers|ngx.send_headers]] or explicit response body outputs by either [[#ngx.print|ngx.print]] or [[#ngx.say|ngx.say]].
zh_cn: 这个方法 ''必须'' 在 [[#ngx.send_headers|ngx.send_headers]] 或使用[[#ngx.printngx.print]] or [[#ngx.sayngx.say]]进行显式的响应体输出之前调用.

source: This method also makes the current cosocket object enter the "closed" state, so there is no need to manually call the [[#tcpsock:close|close]] method on it afterwards.
zh_cn: 此方法将使当前cosocket对象进入 "closed" 状态, 所以后续不需要对其调用 [[#tcpsock:close|close]] .

source: This method call terminates the current request's processing and never returns.
zh_cn: 这个方法将终止当前请求的处理，永不返回.

source: This method does not actuall free up all the memory blocks in the dictionary but just marks all the existing items as expired.
zh_cn: 此方法事实上不会释放字典中所有的内存块，只是让所有现有的项置过期。

source: This method is a synchronous operation and is 100% nonblocking.
zh_cn: 这是一个同步的，100%非阻塞的操作.

source: This method is a synchronous operation just like the [[#tcpsock:send|send]] method and is 100% nonblocking.
zh_cn: 与[[#tcpsock:sendsend]]一样，本方法是一个同步的100％非阻塞的操作.

source: This method is a synchronous operation that will not return until ''all'' the data has been flushed into the system socket send buffer or an error occurs.
zh_cn: 本方法是个同步操作，直到 ''所有''数据被写入系统socket发送缓冲区，或者出错时才返回.

source: This method is similar to the [[HttpEchoModule#echo_exec|echo_exec]] directive of the [[HttpEchoModule]].
zh_cn: 此方法类似于 [[HttpEchoModule]] 的 [[HttpEchoModule#echo_exec|echo_exec]] 命令.

source: This method is very much like the [[HttpRewriteModule#rewrite|rewrite]] directive with the <code>redirect</code> modifier in the standard [[HttpRewriteModule]], for example, this <code>nginx.conf</code> snippet
zh_cn: 此方法很象标准[[HttpRewriteModule]]中带有<code>redirect</code>选项的 [[HttpRewriteModule#rewrite|rewrite]] 命令, 例如这段 <code>nginx.conf</code> 配置

source: This method may lock the dictionary for quite a while and block all the nginx worker processes that are trying to access the dictionary.
zh_cn: 这个方法可能会将字典锁一段时间，阻塞试图访问此字典的所有nginx worker进程。

source: This method never returns.
zh_cn: 这个方法永不返回.

source: This method performs better on relatively long <code>str</code> inputs (i.e., longer than 30 ~ 60 bytes), as compared to [[#ngx.crc32_short|ngx.crc32_short]].
zh_cn: 此方法对于相对长的 <code>str</code> 参数(大于 30 ~ 60 字节) 比 [[#ngx.crc32_short|ngx.crc32_short]]要快.

source: This method performs better on relatively short <code>str</code> inputs (i.e., less than 30 ~ 60 bytes), as compared to [[#ngx.crc32_long|ngx.crc32_long]].
zh_cn: 此方法对于相对短的 <code>str</code> 参数(小于 30 ~ 60 字节) 比 [[#ngx.crc32_long|ngx.crc32_long]]要快.

source: This method requires the PCRE library enabled in Nginx.
zh_cn: 此方法需要Nginx编译时加上 PCRE 库.

source: This method returns an iterator Lua function that can be called to read the data stream until it sees the specified pattern or an error occurs.
zh_cn: 本方法返回一个iterator Lua函数，此函数被用来读取数据流，直到遇到指定的模式或出错。

source: This method returns the (successfully) reused times for the current connection.
zh_cn: 本方法返回当前连接被 (成功) 使用的次数.

source: This method returns the resulting new string as well as the number of successful substitutions.
zh_cn: 返回生成的新字符串以及成功匹配的数目.

source: This method was first introduced in the <code>0.8.6</code> release.
zh_cn: 本命令在 <code>v0.8.6</code> 版本中引入.

source: This method was first introduced in the <code>v0.3.1rc27</code> release.
zh_cn: 本命令在 <code>v0.3.1rc27</code> 版本中引入.

source: This method was first introduced in the <code>v0.5.0rc1</code> release.
zh_cn: 本命令在 <code>v0.5.0rc1</code> 版本中引入.

source: This method was first introduced in the <code>v0.5.6</code> release.
zh_cn: 本命令在 <code>v0.5.6</code> 版本中引入.

source: This method was first introduced in the <code>v0.5.7</code> release.
zh_cn: 本命令在 <code>v0.5.7</code> 版本中引入.

source: This method was first introduced in the <code>v0.7.17</code> release.
zh_cn: 本命令在 <code>v0.7.17</code> 版本中引入.

source: This method was introduced in the <code>0.5.0rc30</code> release.
zh_cn: 本命令在 <code>v0.5.0rc30</code> 版本中引入.

source: This method was introduced in the <code>v0.5.0rc29</code>.
zh_cn: 本命令在 <code>v0.5.0rc29</code> 版本中引入.

source: This method will not return until it reads exactly this size of data or an error occurs.
zh_cn: 本方法将在读取到这个数值大小的数据或出错时才返回.

source: This module embeds Lua, via the standard Lua 5.1 interpreter or [http://luajit.org/luajit.html LuaJIT 2.0], into Nginx and by leveraging Nginx's subrequests, allows the integration of the powerful Lua threads (Lua coroutines) into the Nginx event model.
zh_cn: 此模块将Lua（标准的Lua 5.1或 [http://luajit.org/luajit.html LuaJIT 2.0]）嵌入Nginx, 利用了Nginx的subrequest，把强大的Lua协程（Lua coroutines）集成进Nginx的事件模型。

source: This module is under active development and is production ready.
zh_cn: 模块持续更新中，可用于生产环境。

source: This option is set to <code>false</code> by default
zh_cn: 此选项默认设为 <code>false</code>

source: This option was first introduced in the <code>v0.3.1rc25</code> release.
zh_cn: 本命令在 <code>v0.3.1rc25</code> 版本中引入.

source: This option was first introduced in the <code>v0.3.1rc31</code> release.
zh_cn: 本命令在 <code>v0.3.1rc31</code> 版本中引入.

source: This setting can be overridden by cosocket objects' [[#tcpsock:setkeepalive|setkeepalive]] method.
zh_cn: 可以用 cosocket 对象的' [[#tcpsock:setkeepalive|setkeepalive]] 方法来修改.

source: This setting can be overridden by the [[#tcpsock:settimeout|settimeout]] method.
zh_cn: 可以用 [[#tcpsock:settimeout|settimeout]] 方法进行修改.

source: This should be called before sending out the response headers.
zh_cn: 对它的调用应在发送响应头之前。

source: This table can be used to store per-request Lua context data and has a life time identical to the current request (as with the Nginx variables).
zh_cn: 这个table可用于存储每个请求的Lua上下文数据，其生命周期与当前请求一致 (和 Nginx 变量一样).

source: This transformation can be turned off via the [[#lua_transform_underscores_in_response_headers|lua_transform_underscores_in_response_headers]] directive.
zh_cn: 这个转换可以通过 [[#lua_transform_underscores_in_response_headers|lua_transform_underscores_in_response_headers]] 命令来关闭.

source: This trick can be used do back-ground jobs without letting the HTTP clients to wait on the connection, as in the following example:
zh_cn: 这个技巧可以用来运行后台任务，而不必让HTTP客户端等待连接，如下例:

source: This will be the case if <code>rewrite ^ /bar last</code> is used as this will similarly initiate an internal redirection.
zh_cn: 如果写成 <code>rewrite ^ /bar last</code> 也是同样结果，因为这也会类似地引发内部重定向

source: This will guarantee that local variables in the Lua module functions are all declared with the <code>local</code> keyword, otherwise a runtime exception will be thrown.
zh_cn: 这全保证Lua模块函数中的本地变量都被加上 <code>local</code> 关键字, 否则就会抛出运行时异常.

source: This will truncate the response body and usually result in incomplete and also invalid responses.
zh_cn: 这将会截断响应体，通常会造成不完整并且是无效的响应

source: This works because required Lua modules are loaded only once and all coroutines will share the same copy of the module (both its code and data).
zh_cn: 其工作原理是被require的Lua模块仅加载一次，所有的coroutine将共享这个模块的同一个拷贝 (包括代码和数据).

source: Thus, the Lua code specified by in this directive may also run multiple times in the lifetime of a single HTTP request.
zh_cn: 所以，在单个请求的生命周期中本命令中的代码也可能运行多次。

source: Time consuming code sequences should therefore be avoided.
zh_cn: 所以应避免在这里编写耗时较长的代码序列。

source: Timeout for the connecting operation is controlled by the [[#lua_socket_connect_timeout|lua_socket_connect_timeout]] config directive and the [[#tcpsock:settimeout|settimeout]] method.
zh_cn: 连接操作的超时由 [[#lua_socket_connect_timeout|lua_socket_connect_timeout]] 配置命令和 [[#tcpsock:settimeout|settimeout]] 控制.

source: Timeout for the iterator function's reading operation is controlled by the [[#lua_socket_read_timeout|lua_socket_read_timeout]] config directive and the [[#tcpsock:settimeout|settimeout]] method.
zh_cn: iterator 函数读操作的超时由 [[#lua_socket_read_timeout|lua_socket_read_timeout]] 配置命令和 [[#tcpsock:settimeout|settimeout]] 方法控制.

source: Timeout for the reading operation is controlled by the [[#lua_socket_read_timeout|lua_socket_read_timeout]] config directive and the [[#tcpsock:settimeout|settimeout]] method.
zh_cn: 读操作的超时由 [[#lua_socket_read_timeout|lua_socket_read_timeout]] 配置命令和 [[#tcpsock:settimeout|settimeout]] 方法控制.

source: Timeout for the reading operation is controlled by the [[#lua_socket_read_timeout|lua_socket_read_timeout]] config directive and the [[#udpsock:settimeout|settimeout]] method.
zh_cn: 读操作的超时由 [[#lua_socket_read_timeout|lua_socket_read_timeout]] 配置命令和 [[#udpsock:settimeout|settimeout]] 方法控制.

source: Timeout for the sending operation is controlled by the [[#lua_socket_send_timeout|lua_socket_send_timeout]] config directive and the [[#tcpsock:settimeout|settimeout]] method.
zh_cn: 发送操作的超时由 [[#lua_socket_send_timeout|lua_socket_send_timeout]] 配置命令和 [[#tcpsock:settimeout|settimeout]] 管理.

source: To avoid this, ''double'' escape the backslash:
zh_cn: 为了避免错误，要进行 ''双重'' 转义 :

source: To avoid this, define a real Lua module and use the Lua <code>require</code> builtin instead.
zh_cn: 为避免这种错误，定义一个真正的 Lua 模块而用内置的 <code>require</code> 加载.

source: To confirm that PCRE JIT is enabled, activate the Nginx debug log by adding the <code>--with-debug</code> option to Nginx or ngx_openresty's <code>./configure</code> script.
zh_cn: 要确认打开了 PCRE JIT , 给Nginx 或 ngx_openresty's <code>./configure</code>加上<code>--with-debug</code>选项，打开Nginx debug日志.

source: To ensure code caching, you can either use the [[#init_by_lua|init_by_lua]] or [[#init-by_lua_file|init_by_lua_file]] directives to load all such files or just make these Lua files true Lua modules and load them via <code>require</code>.
zh_cn: 为了保证代码被缓存，你要么用 [[#init_by_lua|init_by_lua]] 或 [[#init-by_lua_file|init_by_lua_file]] 命令来加载文件或将这些Lua文件写成真正的Lua模块，并使用 <code>require</code> 来加载.

source: To force <code>curl</code> to send HTTP 1.0 requests, use the <code>-0</code> option.
zh_cn: 要强制 <code>curl</code> 发送 HTTP 1.0 请求, 使用 <code>-0</code> 选项.

source: To force in-file request bodies, try turning on [[HttpCoreModule#client_body_in_file_only|client_body_in_file_only]].
zh_cn: 要强制使用文件请求体, 打开 [[HttpCoreModule#client_body_in_file_only|client_body_in_file_only]].

source: To force in-memory request bodies, try setting [[HttpCoreModule#client_body_buffer_size|client_body_buffer_size]] to the same size value in [[HttpCoreModule#client_max_body_size|client_max_body_size]].
zh_cn: 要强制使用内存请求体，将 [[HttpCoreModule#client_body_buffer_size|client_body_buffer_size]] 设置成与 [[HttpCoreModule#client_max_body_size|client_max_body_size]] 同样的值.

source: To globally share data among all the requests handled by the same nginx worker process, encapsulate the shared data into a Lua module, use the Lua <code>require</code> builtin to import the module, and then manipulate the shared data in Lua.
zh_cn: 要在同一个nginx worker进程处理的所有请求之间共享数据，将共享数据封装到一个Lua模块中，使用内置的 <code>require</code> 引入模块, 然后用Lua操作共享的数据.

source: To output very large response data in a streaming fashion (via the [[#ngx.flush|ngx.flush]] call, for example), this directive MUST be turned off to minimize memory usage.
zh_cn: 如果要以流的方式输出大的响应数据 (例如通过 [[#ngx.flush|ngx.flush]] 调用), 本命令必须关闭来使内存的使用最小化。

source: To prevent extreme consequences like crashing the Nginx server, there are built-in limitations on both the number of "pending timers" and the number of "running timers" in an Nginx worker process.
zh_cn: 为了避免象导致Nginx服务器崩溃这种极端后果，对于一个Nginx worker进程中的"等待中"的定时器和"运行中"的定时器数量都有内置的限制.

source: To quote the PCRE manpage, "the limit ... has the effect of limiting the amount of backtracking that can take place."
zh_cn: 引自 PCRE manpage： "这个上限... 是用来限制正则表达式中允许的backtracking的最大数目"

source: To read an individual header:
zh_cn: 要读取某一个头:

source: To read the request body data within the [[HttpCoreModule#$request_body|$request_body]] variable, [[HttpCoreModule#client_body_buffer_size|client_body_buffer_size]] must have the same value as [[HttpCoreModule#client_max_body_size|client_max_body_size]].
zh_cn: 要在 [[HttpCoreModule#$request_body|$request_body]] 变量中读取请求体数据, [[HttpCoreModule#client_body_buffer_size|client_body_buffer_size]] 必须与 [[HttpCoreModule#client_max_body_size|client_max_body_size]] 的值相同.

source: To return an error page with custom contents, use code snippets like this:
zh_cn: 要返回带有自定义内容的错误页面, 使用这样的代码:

source: To run in synchronous mode, call <code>ngx.flush(true)</code> after calling <code>ngx.print</code>.
zh_cn: 要在同步模式中运行，在<code>ngx.print</code> 之后调用 <code>ngx.flush(true)</code> .
